cask_args appdir: "~/Applications"

tap 'thoughtbot/formulae'

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
brew 'gnu-sed'
brew 'grep'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install Bash 4.
# running `chsh`.
brew 'bash'

brew 'bash-completion2'

# Install `wget` with IRI support.
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'grep'
brew 'openssh'
brew 'screen'

# Install other useful binaries.
brew 'ack'
brew 'dark-mode'
brew 'git'

brew 'gitsh'
brew 'hub'
brew 'git-lfs'
brew 'imagemagick'
brew 'lua'
brew 'p7zip'
brew 'pigz'
brew 'webkit2png'
brew 'autojump'
brew 'rbenv'
brew 'pyenv'
brew 'tree'
brew 'tig'
brew 'pgcli'
brew 'ffmpeg'
brew 'awscli'
brew 'direnv'
brew 'bat'
brew 'hyperfine' # Benchmarking tool
brew 'fd' # Find replacement
brew 'asciinema'
brew 'blink1'
brew 'ncdu'
brew 'httpie'
brew 'blink1'

tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
brew 'ripgrep-bin'

# GNU Calendar to replace cal
brew 'gcal'

# FZF
brew 'fzf'

# Fun Stuff with No Purpose
brew 'cowsay'
brew 'figlet'
brew 'fortune'
brew 'no-more-secrets'
brew 'watch'
brew 'asciiquarium'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'rainbarf'

# Security/Yubikey Stuff
brew 'gpg'
brew 'pinentry-mac'

# Vim Stuff
brew 'nvim'
brew 'ctags'
brew 'editorconfig'
tap 'ValeLint/vale'
brew 'vale'
brew 'python'

# TLDR Man Pages
brew 'tldr'

brew 'nnn'

brew 'rustup'

brew 'go'
brew 'knqyf263/pet/pet'

brew 'yarn'
brew 'task'
brew 'tasksh'

cask 'pencil'
cask 'paintbrush'
cask 'dash'
cask 'alfred'
cask 'moom'
cask 'vlc'
cask 'chromedriver'
cask 'google-backup-and-sync'
cask 'bartender'
cask 'openshot-video-editor'
cask 'alacritty'
cask 'pock'
cask 'dash'

# Install Hack Nerd Font
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
